USE PD_311_HW

GO

INSERT 
Disciplines(discipline_id,discipline_name,number_of_lessons,report_type)
VALUES
(1,N'Процедурное программирование на языке С++',96,1),
(2,N'ООП на С++',76,1),
(3,N'UML',18,2),
(4,N'Платфорама .NET',32,1),
(5,N'Разработка Windows приложений на С++',18,1),
(6,N'Разработка Windows приложений на С#',18,1),
(7,N'Теория баз данных',24,1),
(8,N'Технология доступа к данным ADO.NET',18,1),
(9,N'Разработка WEB-приложений',48,1),
(11,N'Основы програмирования на языке Java',96,1),
(12,N'Разработка Back-End на языке Java',96,1),
(13,N'HTML/CSS',24,1),
(14,N'JavaScript',96,1),
(15,N'MySQL',32,1),
(16,N'PHP',24,1),
(17,N'NodeJS',24,1),
(18,N'ReactJS',24,1),
(19,N'Photoshop',32,1),
(21,N'Illustrator',32,1),
(22,N'Premire Pro',32,1),
(23,N'AgterEffects',48,1),
(24,N'AutoCad',96,1),
(25,N'3DS Max',96,1),
(26,N'Maya',96,1),
(27,N'Blender',96,1),
(28,N'Базовые технологии локальных сетей',24,2),
(29,N'Маршрутизация в IP-сетях',44,1),
(31,N'Протоколы прикладного уровня',44,1),
(32,N'Hardware-PC',48,1),
(33,N'Администрирование Windows',32,1),
(34,N'Администрирование Windows Server',32,1),
(35,N'Администрирование UNIX',32,1),
(36,N'GameDev',76,1),
(37,N'Android Development',32,1)
  