USE PD_311_HW

GO

INSERT 
Teachers (last_name,first_name,middle_name,birth_date,work_since,rate)
--VALUES(1,'Волосова','Кристина','Станиславована','2001-01-04','2024-10-16',34)
--VALUES(2,'Колесова','Александра','Евгеньевна','1995-12-23','2024-10-16',34)
VALUES
	('Ковтун','Олег','Анатольевич','1982-01-16','2009-04-04',50),
	('Покидюк','Марина','Олеговна','1990-09-06','2022-07-07',50),
	('Кобылинский','Андрей','Анатольевич','1981-02-18','2003-09-01',50),
	('Лялька','Александр','Владимирович','1989-05-15','2008-08-01',50),
	('Глазунов','Антон','Александрович','1985-02-25','2022-06-09',50),
	('Твердохлеб','Александр','Павлович','1981-10-29','2007-10-10',50)